weird, works locally for me with the configuration you posted. Can you post the exact HCL you are using?
```shell
$ terraform -v
Terraform v0.13.4
+ provider registry.terraform.io/hashicorp/aws v3.9.0
```
```hcl
resource "aws_backup_vault" "example" {
  name        = "example_backup_vault"
}

resource "aws_backup_plan" "example" {
  name = "tf_example_backup_plan"

  rule {
    rule_name         = "tf_example_backup_rule"
    target_vault_name = aws_backup_vault.example.name
    schedule          = "cron(0 12 * * ? *)"
  }

  tags = { foo = "bar" }
}
```
```shell
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_backup_plan.example will be created
  + resource "aws_backup_plan" "example" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "tf_example_backup_plan"
      + tags    = {
          + "foo" = "bar"
        }
      + version = (known after apply)

      + rule {
          + completion_window = 180
          + rule_name         = "tf_example_backup_rule"
          + schedule          = "cron(0 12 * * ? *)"
          + start_window      = 60
          + target_vault_name = "example_backup_vault"
        }
    }

  # aws_backup_vault.example will be created
  + resource "aws_backup_vault" "example" {
      + arn             = (known after apply)
      + id              = (known after apply)
      + kms_key_arn     = (known after apply)
      + name            = "example_backup_vault"
      + recovery_points = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_backup_vault.example: Creating...
aws_backup_vault.example: Creation complete after 2s [id=example_backup_vault]
aws_backup_plan.example: Creating...
aws_backup_plan.example: Creation complete after 1s [id=8ea113e5-1aa3-4398-b27b-6b65c24f30a6]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```